using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace GeneralDLL.DTO.SystemEnums
{
    public enum Message_Type_System
    {
        /// <summary>
        /// عضویت در سامانه - پیام اول سیستم - هیچ دکمه ای نمایش داده نمیشود
        /// </summary>
        [Description("عضویت در سامانه - پیام اول سیستم - هیچ دکمه ای نمایش داده نمیشود")]
        Register_StartupMessage = 0,
        /// <summary>
        /// عضویت در سامانه - پیام اول سیستم - هیچ دکمه ای نمایش داده نمیشود - فقط برای تلگرام - باید لیستی از پروکسی ها به انتهای آن اضافه گردد - بعد از این پیام پیامم شماره 0 ارسال خواهد شد
        /// </summary>
        [Description("عضویت در سامانه - پیام اول سیستم - هیچ دکمه ای نمایش داده نمیشود - فقط برای تلگرام - باید لیستی از پروکسی ها به انتهای آن اضافه گردد - بعد از این پیام پیامم شماره 0 ارسال خواهد شد")]
        Register_StartupMessage_Telegram = 1,
        /// <summary>
        /// عضویت در سامانه - کاربر شماره همراه را اشتباه وارد کرده - هیچ دکمه ای نمایش داده نمیشود
        /// </summary>
        [Description("عضویت در سامانه - کاربر شماره همراه را اشتباه وارد کرده - هیچ دکمه ای نمایش داده نمیشود")]
        Register_MobileNumberIsWrong = 10,
        /// <summary>
        /// عضویت در سامانه - کاربر درخواست تغییر شماره همراه داده است - هیچ دکمه ای نمایش داده نمیشود
        /// </summary>
        [Description("عضویت در سامانه - کاربر درخواست تغییر شماره همراه داده است - هیچ دکمه ای نمایش داده نمیشود")]
        Register_Request_ReEnterMobileNumber = 11,
        /// <summary>
        /// عضویت در سامانه - کاربر شماره همراه را درست وارد کرده – باید OTP را وارد کند - دکمه ارسال مجدد OTP و یا تغییر شماره همراه نمایش داده میشود
        /// </summary>
        [Description("عضویت در سامانه - کاربر شماره همراه را درست وارد کرده – باید OTP را وارد کند - دکمه ارسال مجدد OTP و یا تغییر شماره همراه نمایش داده میشود")]
        Register_EnterOTP = 19,
        /// <summary>
        /// عضویت در سامانه - کاربر OTP را اشتباه وارد کرده - دکمه ارسال مجدد OTP و یا تغییر شماره همراه نمایش داده میشود – کاربر هنوز میتواند OTP قبلی را وارد کند
        /// </summary>
        [Description("عضویت در سامانه - کاربر OTP را اشتباه وارد کرده - دکمه ارسال مجدد OTP و یا تغییر شماره همراه نمایش داده میشود – کاربر هنوز میتواند OTP قبلی را وارد کند")]
        Register_OTPIsWrong = 20,
        /// <summary>
        /// عضویت در سامانه - کاربر درخواست ارسال مجدد OTP داده است – دکمه تغییر شماره همراه نمایش داده میشود
        /// </summary>
        [Description("عضویت در سامانه - کاربر درخواست ارسال مجدد OTP داده است – دکمه تغییر شماره همراه نمایش داده میشود")]
        Register_Request_ReSendOTP = 21,
        /// <summary>
        /// عضویت در سامانه - OTP منقضی شده - OTP جدید ارسال گردیده - دکمه های تغییر شماره همراه و ارسال مجدد OTP دارد
        /// </summary>
        [Description("عضویت در سامانه - OTP منقضی شده - OTP جدید ارسال گردیده - دکمه های تغییر شماره همراه و ارسال مجدد OTP دارد")]
        Register_OTPIsWrong_Expire = 22,
        /// <summary>
        /// عضویت کاربر - ثبت درست مبایل
        /// </summary>
        [Description("عضویت کاربر - ثبت درست مبایل")]
        Register_SaveMobileCorrectly = 40,
        /// <summary>
        /// معرف - پیام سوال برای اینکه ببینیم معرف داشته یا خیر - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("معرف - پیام سوال برای اینکه ببینیم معرف داشته یا خیر - دکمه صفحه اصلی نمایش داده میشود")]
        WelcomeInviteMessage_Main = 50,
        /// <summary>
        /// معرف - کد وارد شده صحیح می باشد - تاییدیه شماره همراه معرف - در متن باید قسمتی از شماره همراه نمایش داده شود
        /// </summary>
        [Description("معرف - کد وارد شده صحیح می باشد - تاییدیه شماره همراه معرف - در متن باید قسمتی از شماره همراه نمایش داده شود")]
        WelcomeInviteMessage_ConfirmMobile = 60,
        /// <summary>
        /// معرف - کد وارد شده صحیح می باشد - ذخیره کامل شده
        /// </summary>
        [Description("معرف - کد وارد شده صحیح می باشد - ذخیره کامل شده")]
        WelcomeInviteMessage_SaveComplete = 65,
        /// <summary>
        /// معرف - کد وارد شده صحیح می باشد - کاربر شماره همراه را تایید نکرده است - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("معرف - کد وارد شده صحیح می باشد - کاربر شماره همراه را تایید نکرده است - دکمه صفحه اصلی نمایش داده میشود")]
        WelcomeInviteMessage_UserDontConfirm_MustEnterNewCode = 66,
        /// <summary>
        /// معرف - کد وارد شده صحیح نمی باشد - یافت نشد - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("معرف - کد وارد شده صحیح نمی باشد - یافت نشد - دکمه صفحه اصلی نمایش داده میشود")]
        WelcomeInviteMessage_InvalidCode = 70,
        /// <summary>
        /// معرف - کد وارد شده صحیح نمی باشد - دور باطل وجود دارد - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("معرف - کد وارد شده صحیح نمی باشد - دور باطل وجود دارد - دکمه صفحه اصلی نمایش داده میشود")]
        WelcomeInviteMessage_InvalidCode_LoopFind = 80,
        /// <summary>
        /// پیام خوش آمدگویی به بات - سیستم امروز مسابقه دارد
        /// </summary>
        [Description("پیام خوش آمدگویی به بات - سیستم امروز مسابقه دارد")]
        Welcome_SystemHave_TodayMatch = 210,
        /// <summary>
        /// پیام خوش آمدگویی به بات - سیستم آینده مسابقه دارد
        /// </summary>
        [Description("پیام خوش آمدگویی به بات - سیستم آینده مسابقه دارد")]
        Welcome_SystemHave_FutureMatch = 220,
        /// <summary>
        /// پیام خوش آمدگویی به بات - مسابقه ای یافت نشد - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("پیام خوش آمدگویی به بات - مسابقه ای یافت نشد - دکمه صفحه اصلی نمایش داده میشود")]
        Welcome_NoMatchFound = 230,
        /// <summary>
        /// صفحه اصلی
        /// </summary>
        [Description("صفحه اصلی")]
        MainPage = 1000,
        /// <summary>
        /// پیام راهنمایی - کمک میخوام
        /// </summary>
        [Description("پیام راهنمایی - کمک میخوام")]
        HelpMessage = 1100,
        /// <summary>
        /// پیام راهنمایی - کلی
        /// </summary>
        [Description("پیام راهنمایی - کلی")]
        HelpMessage_All = 1101,
        /// <summary>
        /// پیام راهنمایی - چه طور جوایز دعوت را بگیرم
        /// </summary>
        [Description("پیام راهنمایی - چه طور جوایز دعوت را بگیرم")]
        HelpMessage_GetInvitePrize = 1102,
        /// <summary>
        /// پیام راهنمایی - چگونه دوستانم را دعوت کنم
        /// </summary>
        [Description("پیام راهنمایی - چگونه دوستانم را دعوت کنم")]
        HelpMessage_HowInviteOthers = 1103,
        /// <summary>
        /// پیام راهنمایی - شرکت در مسابقه
        /// </summary>
        [Description("پیام راهنمایی - شرکت در مسابقه")]
        HelpMessage_PlayInGame = 1104,
        /// <summary>
        /// پیام راهنمایی - اطلاع از نتیجه مسابقات
        /// </summary>
        [Description("پیام راهنمایی - اطلاع از نتیجه مسابقات")]
        HelpMessage_SeeResultMatch = 1105,
        /// <summary>
        /// پیام راهنمایی - شارژ کیف پول
        /// </summary>
        [Description("پیام راهنمایی - شارژ کیف پول")]
        HelpMessage_ChargeURL = 1106,
        /// <summary>
        /// پیام راهنمایی - نحوه دریافت جایزه مسابقه
        /// </summary>
        [Description("پیام راهنمایی - نحوه دریافت جایزه مسابقه")]
        HelpMessage_GetPrize = 1107,
        /// <summary>
        /// درباره ما
        /// </summary>
        [Description("درباره ما")]
        AboutMessage = 1200,
        /// <summary>
        /// کیف پول کاربر - نمایش اطلاعات - دسترسی به کیف پول هست - دکمه شارژ حساب دارد و انتخاب کیف پول
        /// </summary>
        [Description("کیف پول کاربر - نمایش اطلاعات - دسترسی به کیف پول هست - دکمه شارژ حساب دارد و انتخاب کیف پول")]
        UserWallet_Information_Access = 2000,
        /// <summary>
        /// کیف پول کاربر - نمایش اطلاعات - دسترسی به کیف پول نیست - دکمه ایجاد دسترسی دارد
        /// </summary>
        [Description("کیف پول کاربر - نمایش اطلاعات - دسترسی به کیف پول نیست - دکمه ایجاد دسترسی دارد")]
        UserWallet_Information_NoAccess = 2001,
        /// <summary>
        /// کیف پول کاربر - انتخاب نوع کیف پول - برای هر کیف پول یک دکمه
        /// </summary>
        [Description("کیف پول کاربر - انتخاب نوع کیف پول - برای هر کیف پول یک دکمه")]
        UserWallet_SelectWallet = 2020,
        /// <summary>
        /// کیف پول کاربر - انتخاب نوع کیف پول - ذخیره درست انجام شد
        /// </summary>
        [Description("کیف پول کاربر - انتخاب نوع کیف پول - ذخیره درست انجام شد")]
        UserWallet_SelectWallet_SaveDone = 2030,
        /// <summary>
        /// کیف پول کاربر - دسترسی به کیف پول - نمایش Access URL
        /// </summary>
        [Description("کیف پول کاربر - دسترسی به کیف پول - نمایش Access URL")]
        UserWallet_AccessURL = 2050,
        /// <summary>
        /// کیف پول کاربر - دسترسی به کیف پول - با موفقیت
        /// </summary>
        [Description("کیف پول کاربر - دسترسی به کیف پول - با موفقیت")]
        UserWallet_Access_Done = 2051,
        /// <summary>
        /// کیف پول کاربر - دسترسی به کیف پول - نا موفق
        /// </summary>
        [Description("کیف پول کاربر - دسترسی به کیف پول - نا موفق")]
        UserWallet_Access_Error = 2052,
        /// <summary>
        /// کیف پول کاربر - شارژ - اطلاعات درست از سمت Callback URL برگشته است
        /// </summary>
        [Description("کیف پول کاربر - شارژ - اطلاعات درست از سمت Callback URL برگشته است")]
        UserWallet_Balance_CallBackFromURL = 2060,
        /// <summary>
        /// کیف پول کاربر - شارژ حساب - انتخاب مبلغ - برای بعضی مقادیر دکمه - قابلیت ورود دستی مبلغ هم وجود دارد
        /// </summary>
        [Description("کیف پول کاربر - شارژ حساب - انتخاب مبلغ - برای بعضی مقادیر دکمه - قابلیت ورود دستی مبلغ هم وجود دارد")]
        UserWallet_Charge_SelectPrice = 2100,
        /// <summary>
        /// کیف پول کاربر - شارژ حساب - انتخاب مبلغ - مقدار پول دستی وارد شده درست نمیباشد
        /// </summary>
        [Description("کیف پول کاربر - شارژ حساب - انتخاب مبلغ - مقدار پول دستی وارد شده درست نمیباشد")]
        UserWallet_Charge_SelectPrice_ErrorValue = 2101,
        /// <summary>
        /// کیف پول کاربر - شارژ حساب - انتخاب مبلغ - نمایش Charge URL
        /// </summary>
        [Description("کیف پول کاربر - شارژ حساب - انتخاب مبلغ - نمایش Charge URL")]
        UserWallet_Charge_URL = 2102,
        /// <summary>
        /// لیست دعوت های من - ذخیره معرف - نمایش اطلاعات اولیه
        /// </summary>
        [Description("لیست دعوت های من - ذخیره معرف - نمایش اطلاعات اولیه")]
        InvitePerson_Save_MainPage = 2300,
        /// <summary>
        /// لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح می باشد - تاییدیه شماره مبایل - قسمتی از شماره همراه باید نمایش داده شود
        /// </summary>
        [Description("لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح می باشد - تاییدیه شماره مبایل - قسمتی از شماره همراه باید نمایش داده شود")]
        InvitePerson_Save_ConfirmMobile = 2310,
        /// <summary>
        /// لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح می باشد - ذخیره کامل شده - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح می باشد - ذخیره کامل شده - دکمه صفحه اصلی نمایش داده میشود")]
        InvitePerson_Save_Complete = 2320,
        /// <summary>
        /// لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح می باشد - کاربر شماره همراه را تایید نکرده است - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح می باشد - کاربر شماره همراه را تایید نکرده است - دکمه صفحه اصلی نمایش داده میشود")]
        InvitePerson_Save_UserDontConfirm_MustEnterNewCode = 2330,
        /// <summary>
        /// لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح نمی باشد - یافت نشد - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح نمی باشد - یافت نشد - دکمه صفحه اصلی نمایش داده میشود")]
        InvitePerson_Save_InvalidCode = 2340,
        /// <summary>
        /// لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح نمی باشد - دور باطل وجود دارد - دکمه صفحه اصلی نمایش داده میشود
        /// </summary>
        [Description("لیست دعوت های من - ذخیره معرف - کد وارد شده صحیح نمی باشد - دور باطل وجود دارد - دکمه صفحه اصلی نمایش داده میشود")]
        InvitePerson_Save_InvalidCode_LoopFind = 2350,
        /// <summary>
        /// لیست دعوت های من - تبلیغات
        /// </summary>
        [Description("لیست دعوت های من - تبلیغات")]
        InvitePerson_Adverstiment = 2380,
        /// <summary>
        /// لیست دعوت های من - دریافت پول - گزارش - کاربر جایزه برای برداشت دارد - مشکلی برای برداشت نیست - دکمه برداشت و صفحه اصلی دارد
        /// </summary>
        [Description("لیست دعوت های من - دریافت پول - گزارش - کاربر جایزه برای برداشت دارد - مشکلی برای برداشت نیست - دکمه برداشت و صفحه اصلی دارد")]
        InvitePerson_GetMoney_Report_NoProblem = 2400,
        /// <summary>
        /// لیست دعوت های من - دریافت پول - گزارش - مشکل - جایزه ای وجود ندارد - دکمه صفحه اصلی دارد
        /// </summary>
        [Description("لیست دعوت های من - دریافت پول - گزارش - مشکل - جایزه ای وجود ندارد - دکمه صفحه اصلی دارد")]
        InvitePerson_GetMoney_Report_Error_NoPrize = 2410,
        /// <summary>
        /// لیست دعوت های من - دریافت پول - گزارش - مشکل - جایزه ای وجود دارد - کاربر پرداخت ندارد - دکمه صفحه اصلی دارد
        /// </summary>
        [Description("لیست دعوت های من - دریافت پول - گزارش - مشکل - جایزه ای وجود دارد - کاربر پرداخت ندارد - دکمه صفحه اصلی دارد")]
        InvitePerson_GetMoney_Report_Error_HasPrizeNoPaymentUser = 2420,
        /// <summary>
        /// لیست دعوت های من - دریافت پول - گزارش - مشکل - جایزه ای وجود دارد - کاربر پرداخت دارد - اطلاعات کاربر کامل نیست - دکمه صفحه اصلی دارد
        /// </summary>
        [Description("لیست دعوت های من - دریافت پول - گزارش - مشکل - جایزه ای وجود دارد - کاربر پرداخت دارد - اطلاعات کاربر کامل نیست - دکمه صفحه اصلی دارد")]
        InvitePerson_GetMoney_Report_Error_HasPrizeHasPaymentNoPersonInformation = 2430,
        /// <summary>
        /// لیست دعوت های من - دریافت پول - ذخیره کامل انجام شد - دکمه صفحه اصلی دارد
        /// </summary>
        [Description("لیست دعوت های من - دریافت پول - ذخیره کامل انجام شد - دکمه صفحه اصلی دارد")]
        InvitePerson_GetMoney_SaveGetPrize = 2440,
        /// <summary>
        /// پروفایل - صفحه اصلی - دکمه برای تغییرات - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - صفحه اصلی - دکمه برای تغییرات - دکمه صفحه اصلی")]
        Profile_MainPage = 3000,
        /// <summary>
        /// پروفایل - به روز رسانی - نام - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - نام - دکمه صفحه اصلی")]
        Profile_Update_Name = 3010,
        /// <summary>
        /// پروفایل - به روز رسانی - نام خانوادگی - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - نام خانوادگی - دکمه صفحه اصلی")]
        Profile_Update_Family = 3020,
        /// <summary>
        /// پروفایل - به روز رسانی - کد ملی - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - کد ملی - دکمه صفحه اصلی")]
        Profile_Update_CodeMeli = 3030,
        /// <summary>
        /// پروفایل - به روز رسانی - مشکل - کد ملی اشتباه وارد شده - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - مشکل - کد ملی اشتباه وارد شده - دکمه صفحه اصلی")]
        Profile_Update_CodeMelli_Error = 3034,
        /// <summary>
        /// پروفایل - به روز رسانی - شماره کارت بانکی - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - شماره کارت بانکی - دکمه صفحه اصلی")]
        Profile_Update_BankCard = 3040,
        /// <summary>
        /// پروفایل - به روز رسانی - شماره کارت بانکی اشتباه است - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - شماره کارت بانکی اشتباه است - دکمه صفحه اصلی")]
        Profile_Update_BankCard_Error = 3044,
        /// <summary>
        /// پروفایل - به روز رسانی - اطلاعات به درستی ذخیره گردید - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - اطلاعات به درستی ذخیره گردید - دکمه صفحه اصلی")]
        Profile_Update_SaveCorrectly = 4000,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - فرد مسابقه دارد
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - فرد مسابقه دارد")]
        Profile_View_FinishedMatches_HaveMatch = 4500,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - فرد مسابقه ندارد
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - فرد مسابقه ندارد")]
        Profile_View_FinishedMatches_NoMatch = 4505,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - در حال بازی بوده - دکمه هر بازی + صفحه اصلی
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - در حال بازی بوده - دکمه هر بازی + صفحه اصلی")]
        Profile_View_FinishedMatches_InGame = 4510,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - برنده بوده - دکمه هر بازی + صفحه اصلی
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - برنده بوده - دکمه هر بازی + صفحه اصلی")]
        Profile_View_FinishedMatches_Winner = 4520,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - بازنده بوده - دکمه هر بازی + صفحه اصلی
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - بازنده بوده - دکمه هر بازی + صفحه اصلی")]
        Profile_View_FinishedMatches_Looser = 4530,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - دیدن وضعیت فرد در مسابقه - فرد در حال بازی- دکمه: صفحه اصلی
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - دیدن وضعیت فرد در مسابقه - فرد در حال بازی- دکمه: صفحه اصلی")]
        Profile_View_FinishedMatches_ViewResult_InGame = 4540,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - دیدن وضعیت فرد در مسابقه - فرد برنده - دکمه: صفحه اصلی
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - دیدن وضعیت فرد در مسابقه - فرد برنده - دکمه: صفحه اصلی")]
        Profile_View_FinishedMatches_ViewResult_Winner = 4550,
        /// <summary>
        /// پروفایل - رویت مسابقات اتمام شده فرد - دیدن وضعیت فرد در مسابقه - فرد بازنده - دکمه: صفحه اصلی
        /// </summary>
        [Description("پروفایل - رویت مسابقات اتمام شده فرد - دیدن وضعیت فرد در مسابقه - فرد بازنده - دکمه: صفحه اصلی")]
        Profile_View_FinishedMatches_ViewResult_Looser = 4560,
        /// <summary>
        /// پروفایل - دیدن 10 هزینه کرد کاربر در سیستم - قیمت/مسابقه/تاریخ  - اطلاعات تکمیلی در انتهای پیام اضافه میگردد - دکمه: صفحه اصلی
        /// </summary>
        [Description("پروفایل - دیدن 10 هزینه کرد کاربر در سیستم - قیمت/مسابقه/تاریخ  - اطلاعات تکمیلی در انتهای پیام اضافه میگردد - دکمه: صفحه اصلی")]
        Profile_View_Payment10 = 4800,
        /// <summary>
        /// پروفایل - به روز رسانی - مشکل - اجبار ورود اطلاعات - دکمه صفحه اصلی
        /// </summary>
        [Description("پروفایل - به روز رسانی - مشکل - اجبار ورود اطلاعات - دکمه صفحه اصلی")]
        Profile_Update_Error_MustEnterText = 4900,
        /// <summary>
        /// مسابقات - لیست اطلاعات اولیه - امروز - دکمه: - اول مسابقات در حال بازی - بعد دکمه مسابقات جدید
        /// </summary>
        [Description("مسابقات - لیست اطلاعات اولیه - امروز - دکمه: - اول مسابقات در حال بازی - بعد دکمه مسابقات جدید")]
        Match_ListInfo_Today = 5000,
        /// <summary>
        /// مسابقات - لیست اطلاعات اولیه - آینده
        /// </summary>
        [Description("مسابقات - لیست اطلاعات اولیه - آینده")]
        Match_ListInfo_Future = 5020,
        /// <summary>
        /// مسابقات - لیست انتخابی کاربر - امروز - دکمه: - اول مسابقات در حال بازی - بعد دکمه مسابقات جدید
        /// </summary>
        [Description("مسابقات - لیست انتخابی کاربر - امروز - دکمه: - اول مسابقات در حال بازی - بعد دکمه مسابقات جدید")]
        Match_ListSelect_Today = 5040,
        /// <summary>
        /// مسابقات - لیست انتخابی کاربر - آینده
        /// </summary>
        [Description("مسابقات - لیست انتخابی کاربر - آینده")]
        Match_ListSelect_Future = 5060,
        /// <summary>
        /// مسابقات - لیست - هیچ مسابقه ای وجود ندارد
        /// </summary>
        [Description("مسابقات - لیست - هیچ مسابقه ای وجود ندارد")]
        Match_List_NoMatch = 5100,
        /// <summary>
        /// مسابقات - نمایش اطلاعات - مسابقه در امروز - دکمه شروع مسابقه - در صورت پذیرفته بودن قوانین رویت قوانین اضافه میگردد
        /// </summary>
        [Description("مسابقات - نمایش اطلاعات - مسابقه در امروز - دکمه شروع مسابقه - در صورت پذیرفته بودن قوانین رویت قوانین اضافه میگردد")]
        Matches_Information_TodayMatch = 5120,
        /// <summary>
        /// مسابقات - نمایش اطلاعات - مسابقه در آینده - دکمه صفحه اصلی
        /// </summary>
        [Description("مسابقات - نمایش اطلاعات - مسابقه در آینده - دکمه صفحه اصلی")]
        Matches_Information_FutureMatch = 5140,
        /// <summary>
        /// مسابقات - نمایش قوانین بازی - دکمه تایید و رد کردن
        /// </summary>
        [Description("مسابقات - نمایش قوانین بازی - دکمه تایید و رد کردن")]
        Matches_Information_Roles = 5200,
        /// <summary>
        /// مسابقات - قبلا شرکت کرده در مسابقه - برنده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود
        /// </summary>
        [Description("مسابقات - قبلا شرکت کرده در مسابقه - برنده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود")]
        Matches_ErrorPlayBefore_Winner = 5300,
        /// <summary>
        /// مسابقات - قبلا شرکت کرده در مسابقه - بازنده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود
        /// </summary>
        [Description("مسابقات - قبلا شرکت کرده در مسابقه - بازنده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود")]
        Matches_ErrorPlayBefore_Looser = 5330,
        /// <summary>
        /// مسابقات - کاربر قبلا بازی کرده - در حال بازی - زمان برگزاری مسابقه به پایان رسیده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود
        /// </summary>
        [Description("مسابقات - کاربر قبلا بازی کرده - در حال بازی - زمان برگزاری مسابقه به پایان رسیده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود")]
        Matches_ErrorPlayBefore_InGame_MatchExpire = 5360,
        /// <summary>
        /// مسابقات - کاربر قبلا بازی نکرده - بازی نکرده - زمان برگزاری مسابقه به پایان رسیده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود
        /// </summary>
        [Description("مسابقات - کاربر قبلا بازی نکرده - بازی نکرده - زمان برگزاری مسابقه به پایان رسیده - پیام 5000 یا 5020 یا 5100 نمایش داده میشود")]
        Matches_ErrorPlayBefore_NoPlay_MatchExpire = 5390,
        /// <summary>
        /// مسابقات - کاربر قصد عضویت دارد - دسترسی به کیف پول وجود ندارد - دکمه دریافت لینک و صفحه اصلی
        /// </summary>
        [Description("مسابقات - کاربر قصد عضویت دارد - دسترسی به کیف پول وجود ندارد - دکمه دریافت لینک و صفحه اصلی")]
        Matches_Payment_HasErrorAccess = 5400,
        /// <summary>
        /// مسابقات - کاربر قصد عضویت دارد - موجودی کیف پول کافی نیست - دکمه دریافت URL شارژ و صفحه اصلی
        /// </summary>
        [Description("مسابقات - کاربر قصد عضویت دارد - موجودی کیف پول کافی نیست - دکمه دریافت URL شارژ و صفحه اصلی")]
        Matches_Payment_ErrorInBalance = 5420,
        /// <summary>
        /// مسابقات - کاربر قصد عضویت دارد - مشکل در عملیات شارژ - دکمه تلاش مجدد و صفحه اصلی
        /// </summary>
        [Description("مسابقات - کاربر قصد عضویت دارد - مشکل در عملیات شارژ - دکمه تلاش مجدد و صفحه اصلی")]
        Matches_Payment_ErrorInChargeProcess = 5440,
        /// <summary>
        /// مسابقات - کاربر قصد عضویت دارد - عملیات به درستی انجام گرفت - پیام 6000 در ادامه ارسال میگردد
        /// </summary>
        [Description("مسابقات - کاربر قصد عضویت دارد - عملیات به درستی انجام گرفت - پیام 6000 در ادامه ارسال میگردد")]
        Matches_Payment_Complete = 5460,
        /// <summary>
        /// مسابقات - در حال بازی - نمایش سوال
        /// </summary>
        [Description("مسابقات - در حال بازی - نمایش سوال")]
        Matches_InGame_ShowQuestion = 5600,
        /// <summary>
        /// مسابقات - در حال بازی - جواب را درست داده
        /// </summary>
        [Description("مسابقات - در حال بازی - جواب را درست داده")]
        Matches_InGame_AnswerTrue = 5630,
        /// <summary>
        /// مسابقات - پایان - جواب را اشتباه داده - پایان بازنده - دکمه صفحه اصلی
        /// </summary>
        [Description("مسابقات - پایان - جواب را اشتباه داده - پایان بازنده - دکمه صفحه اصلی")]
        Matches_Finished_AnswerWrong = 5660,
        /// <summary>
        /// مسابقات - پایان - برنده - دکمه صفحه اصلی
        /// </summary>
        [Description("مسابقات - پایان - برنده - دکمه صفحه اصلی")]
        Matches_Finished_Winer = 5700,
        /// <summary>
        /// مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دکمه صفحه اصلی دارد
        /// </summary>
        [Description("مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دکمه صفحه اصلی دارد")]
        Matches_Lottory_Winner = 5800,
        /// <summary>
        /// مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دسترسی برای کیف پول وجود ندارد - دکمه: ایجاد دسترسی و صفحه اصلی دارد
        /// </summary>
        [Description("مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دسترسی برای کیف پول وجود ندارد - دکمه: ایجاد دسترسی و صفحه اصلی دارد")]
        Matches_Lottory_Winner_WalletNoAccess = 5830,
        /// <summary>
        /// مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دسترسی برای کیف پول وجود نداشته - کاربر دسترسی را داده و منتظر دریافت جایزه است - دکمه: صفحه اصلی دارد
        /// </summary>
        [Description("مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دسترسی برای کیف پول وجود نداشته - کاربر دسترسی را داده و منتظر دریافت جایزه است - دکمه: صفحه اصلی دارد")]
        Matches_Lottory_Winner_WalletNoAccess_UserAllowForGetPrize = 5831,
        /// <summary>
        /// مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دسترسی برای کیف پول وجود ندارد - کاربر از لیست حذف گردید - دکمه صفحه اصلی
        /// </summary>
        [Description("مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - دسترسی برای کیف پول وجود ندارد - کاربر از لیست حذف گردید - دکمه صفحه اصلی")]
        Matches_Lottory_Winner_DeleteFromList = 5860,
        /// <summary>
        /// مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - پرداخت کامل انجام شد - دکمه صفحه اصلی دارد
        /// </summary>
        [Description("مسابقات - بعد از قرعه کشی - کاربر برنده جایزه شده - پرداخت کامل انجام شد - دکمه صفحه اصلی دارد")]
        Matches_Lottory_Winner_PaymentComplete = 5900,
        /// <summary>
        /// مسابقات - ریست شدن بازی به دلیل مشکل - کاربر در حال بازی بوده
        /// </summary>
        [Description("مسابقات - ریست شدن بازی به دلیل مشکل - کاربر در حال بازی بوده")]
        Matches_ResetMatch_PlayInGame = 6000,
        /// <summary>
        /// مسابقات - ریست شدن بازی به دلیل مشکل - کاربر برنده بازی بوده
        /// </summary>
        [Description("مسابقات - ریست شدن بازی به دلیل مشکل - کاربر برنده بازی بوده")]
        Matches_ResetMatch_PlayWinner = 6010,
        /// <summary>
        /// مسابقات - ریست شدن بازی به دلیل مشکل - کاربر بازنده بازی بوده
        /// </summary>
        [Description("مسابقات - ریست شدن بازی به دلیل مشکل - کاربر بازنده بازی بوده")]
        Matches_ResetMatch_PlayLooser = 6020,
        /// <summary>
        /// هشدار سیستمی - بازی امروز - متوقف گردید - دکمه صفحه اصلی
        /// </summary>
        [Description("هشدار سیستمی - بازی امروز - متوقف گردید - دکمه صفحه اصلی")]
        Alert_TodayMatch_Pause = 180000,
        /// <summary>
        /// هشدار سیستمی - بازی امروز - مجددا بازی شروع شده - دکمه ادامه بازی دارد
        /// </summary>
        [Description("هشدار سیستمی - بازی امروز - مجددا بازی شروع شده - دکمه ادامه بازی دارد")]
        Alert_TodayMatch_PlayAgain = 180010,
        /// <summary>
        /// هشدار سیستمی - پرداخت جایزه معرفی به درستی انجام پذیرفت
        /// </summary>
        [Description("هشدار سیستمی - پرداخت جایزه معرفی به درستی انجام پذیرفت")]
        Alert_PrizeInviter_Finished = 180100,
        /// <summary>
        /// مشکل در سیستم
        /// </summary>
        [Description("مشکل در سیستم")]
        SystemError = 190000,
        /// <summary>
        /// پیام ورودی اشتباه
        /// </summary>
        [Description("پیام ورودی اشتباه")]
        ErrorInputMessage = 200000,
    }
}
